var plan = project.addPlan("Крыша");

/* Материалы */
$$Бетон = project.addMaterial("Бетон", 2.400, 4200);
$$Кирпич = project.addMaterial("Кирпич", 2.400, 4200);
$$Доска200х50 = project.addMaterial("Доска 200х50", 0.550, 6500);
$$Брус100х100 = project.addMaterial("Брус 100х100", 0.550, 6500);
$$Брус150х150 = project.addMaterial("Брус 150х150", 0.550, 6500);

var $$Высота_первого_этажа = 3200;
var $$Высота_стены_мансарды = 1400;

/* Кирпичная облицовка
plan.setDefaultMaterial($$Кирпич).setDefaultPattern("brick").setDefaultBackgroundColor(255, 40, 0).setDefaultKeColor(255, 40, 0);
plan.addWall(-20, -20, $$Высота_первого_этажа, 10620, 100, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(-20, 100, $$Высота_первого_этажа, 100, 13500, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(-20, 13500, $$Высота_первого_этажа, 10620, 13620, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(10500, -20, $$Высота_первого_этажа, 10620, 13500, $$Высота_первого_этажа + $$Высота_стены_мансарды);

 Армопояс
plan.setDefaultMaterial($$Бетон).setDefaultPattern("hatchUp").setDefaultBackgroundColor(50, 50, 50).setDefaultKeColor(50, 50, 50);
plan.addWall(200, 200, $$Высота_первого_этажа - 200, 10400, 600, $$Высота_первого_этажа);
plan.addWall(200, 600, $$Высота_первого_этажа - 200, 600, 13000, $$Высота_первого_этажа);
plan.addWall(200, 13000, $$Высота_первого_этажа - 200, 10400, 13400, $$Высота_первого_этажа);
plan.addWall(10000, 600, $$Высота_первого_этажа - 200, 10400, 13000, $$Высота_первого_этажа);
plan.addWall(5700, 600, $$Высота_первого_этажа - 200, 6100, 13000, $$Высота_первого_этажа);

 Перекрытие
plan.setDefaultMaterial($$Бетон).setDefaultPattern("hatchUp").setDefaultBackgroundColor(70, 90, 50).setDefaultKeColor(70, 90, 50);
plan.addWall(200, 200, $$Высота_первого_этажа, 10400, 13400, $$Высота_первого_этажа + 160);
*/
/* Стены */
plan.setDefaultMaterial($$Бетон).setDefaultPattern("hatchUp").setDefaultBackgroundColor(60, 60, 60).setDefaultKeColor(60, 60, 60);
plan.addWall(200, 200, -800, 10400, 600, -100);
plan.addWall(200, 600, -800, 600, 13000, -100);
plan.addWall(200, 13000, -800, 10400, 13400, -100);
plan.addWall(10000, 600, -800, 10400, 13000, -100);

plan.addWall(200, 200, 0, 10400, 600, $$Высота_первого_этажа - 100);
plan.addWall(200, 600, 0, 600, 13000, $$Высота_первого_этажа - 100);
plan.addWall(200, 13000, 0, 10400, 13400, $$Высота_первого_этажа - 100);
plan.addWall(10000, 600, 0, 10400, 13000, $$Высота_первого_этажа - 100);

plan.addWall(200, 200, $$Высота_первого_этажа, 10400, 600, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(200, 600, $$Высота_первого_этажа, 600, 13000, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(200, 13000, $$Высота_первого_этажа, 10400, 13400, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(10000, 600, $$Высота_первого_этажа, 10400, 13000, $$Высота_первого_этажа + $$Высота_стены_мансарды);
plan.addWall(5700, 600, $$Высота_первого_этажа, 6100, 13000, $$Высота_первого_этажа + $$Высота_первого_этажа);


