Console.print("*** Крыша 3D ***\n");

var plan = project.addPlan("Крыша 3D");

/* Материалы */
$$Бетон = project.addMaterial("Бетон", 2.400, 4200);
$$Кирпич = project.addMaterial("Кирпич", 2.400, 4200);
$$Доска200х50 = project.addMaterial("Доска 200х50", 0.550, 6500);
$$Брус100х100 = project.addMaterial("Брус 100х100", 0.550, 6500);
$$Брус150х150 = project.addMaterial("Брус 150х150", 0.550, 6500);

/* Кирпичная облицовка */
plan.setDefaultMaterial($$Кирпич).setDefaultPattern("brick").setDefaultBackgroundColor(255, 40, 0).setDefaultKeColor(255, 40, 0);
plan.addWall(-20, -20, 6800, 10620, 100, 7000);
plan.addWall(-20, 100, 6800, 100, 13500, 7000);
plan.addWall(-20, 13500, 6800, 10620, 13620, 7000);
plan.addWall(10500, -20, 6800, 10620, 13500, 7000);

/* Армопояс */
plan.setDefaultMaterial($$Бетон).setDefaultPattern("hatchUp").setDefaultBackgroundColor(50, 50, 50).setDefaultKeColor(50, 50, 50);
plan.addWall(200, 200, 6800, 10400, 600, 7000);
plan.addWall(200, 600, 6800, 600, 13000, 7000);
plan.addWall(200, 13000, 6800, 10400, 13400, 7000);
plan.addWall(10000, 600, 6800, 10400, 13000, 7000);
plan.addWall(5700, 600, 6800, 6100, 13000, 7000);

/* Балки перекрытия, расстояние между осями 75 см */
plan.setDefaultMaterial($$Доска200х50).setDefaultPattern("background").setDefaultBackgroundColor(50, 50, 0).setDefaultKeColor(50, 50, 0);
var Балки_перекрытия = [
  plan.addBeam(300, 800-50, 6540, 10300, 800-50, 6540, 50, 200), // 0
  plan.addBeam(300, 800+50, 6540, 10300, 800+50, 6540, 50, 200),

  plan.addBeam(300, 1550-50, 6540, 10300, 1550-50, 6540, 50, 200),
  plan.addBeam(300, 1550+50, 6540, 10300, 1550+50, 6540, 50, 200),

  plan.addBeam(300, 2300-50, 6540, 10300, 2300-50, 6540, 50, 200),
  plan.addBeam(300, 2300+50, 6540, 10300, 2300+50, 6540, 50, 200),

  plan.addBeam(300, 3050-50, 6540, 10300, 3050-50, 6540, 50, 200), // 6
  plan.addBeam(300, 3050+50, 6540, 10300, 3050+50, 6540, 50, 200),

  plan.addBeam(300, 3800-50, 6540, 10300, 3800-50, 6540, 50, 200),
  plan.addBeam(300, 3800+50, 6540, 10300, 3800+50, 6540, 50, 200),

  plan.addBeam(300, 4550-50, 6540, 10300, 4550-50, 6540, 50, 200),
  plan.addBeam(300, 4550+50, 6540, 10300, 4550+50, 6540, 50, 200),

  plan.addBeam(300, 5300-50, 6540, 10300, 5300-50, 6540, 50, 200),
  plan.addBeam(300, 5300+50, 6540, 10300, 5300+50, 6540, 50, 200),

  plan.addBeam(300, 6050-50, 6540, 10300, 6050-50, 6540, 50, 200),
  plan.addBeam(300, 6050+50, 6540, 10300, 6050+50, 6540, 50, 200),

  plan.addBeam(300, 6800-50, 6540, 10300, 6800-50, 6540, 50, 200),
  plan.addBeam(300, 6800+50, 6540, 10300, 6800+50, 6540, 50, 200),

  plan.addBeam(300, 7550-50, 6540, 10300, 7550-50, 6540, 50, 200),
  plan.addBeam(300, 7550+50, 6540, 10300, 7550+50, 6540, 50, 200),

  plan.addBeam(300, 8300-50, 6540, 10300, 8300-50, 6540, 50, 200),
  plan.addBeam(300, 8300+50, 6540, 10300, 8300+50, 6540, 50, 200),

  plan.addBeam(300, 9050-50, 6540, 10300, 9050-50, 6540, 50, 200),
  plan.addBeam(300, 9050+50, 6540, 10300, 9050+50, 6540, 50, 200),

  plan.addBeam(300, 9800-50, 6540, 10300, 9800-50, 6540, 50, 200),
  plan.addBeam(300, 9800+50, 6540, 10300, 9800+50, 6540, 50, 200),

  plan.addBeam(300, 10550-50, 6540, 10300, 10550-50, 6540, 50, 200), // 26
  plan.addBeam(300, 10550+50, 6540, 10300, 10550+50, 6540, 50, 200),

  plan.addBeam(300, 11300-50, 6540, 10300, 11300-50, 6540, 50, 200),
  plan.addBeam(300, 11300+50, 6540, 10300, 11300+50, 6540, 50, 200),

  plan.addBeam(300, 12050-50, 6540, 10300, 12050-50, 6540, 50, 200),
  plan.addBeam(300, 12050+50, 6540, 10300, 12050+50, 6540, 50, 200),

  plan.addBeam(300, 12800-50, 6540, 10300, 12800-50, 6540, 50, 200), // 32
  plan.addBeam(300, 12800+50, 6540, 10300, 12800+50, 6540, 50, 200)
];
Вес_балок_перекрытия$тн = 0;
Объем_балок_перекрытия$м3 = 0;
Цена_балок_перекрытия$руб = 0;
for (var i = 0; i < Балки_перекрытия.length; i ++) {
  Вес_балок_перекрытия$тн += Балки_перекрытия[i].getWeight();
  Объем_балок_перекрытия$м3 += Балки_перекрытия[i].getVolume();
  Цена_балок_перекрытия$руб += Балки_перекрытия[i].getPrice();
}

Вес_ферм$тн = 0;
Объем_ферм$м3 = 0;
Цена_ферм$руб = 0;
plan.setDefaultPattern("background").setDefaultBackgroundColor(255, 200, 0).setDefaultKeColor(255, 200, 0);
for (var i = 8; i <= 24; i += 2) {
  var y = Балки_перекрытия[i].getYStart();
  var Стропило_левое = plan.addBeam(0, y+50, 7200, 5300, y+50, 10200, 50, 200).setMaterial($$Доска200х50);
  var Стропило_правое = plan.addBeam(5300, y+50, 10200, 10600, y+50, 7200, 50, 200).setMaterial($$Доска200х50);

  var Соединение_балки_левое = plan.addBeam(2800, y+50, 6540, 3600, y+50, 6540, 50, 200).setMaterial($$Доска200х50);
//  var Стойка_левая = plan.addConnectBeam(Соединение_балки_левое, 3200, Стропило_левое, 100, 100).setMaterial($$Брус100х100);
  var Соединение_балки_правое = plan.addBeam(7000, y+50, 6540, 7800, y+50, 6540, 50, 200).setMaterial($$Доска200х50);
//  var Стойка_правая = plan.addConnectBeam(Соединение_балки_правое, 7400, Стропило_правое, 100, 100).setMaterial($$Брус100х100);

/*  Длина_стойки_фермы$мм = Стойка_левая.getLength();
  Длина_стропила$мм = Стропило_левое.getLength();
  Вес_ферм$тн += Стойка_левая.getWeight() + Стойка_правая.getWeight() +
    Стропило_левое.getWeight() + Стропило_правое.getWeight();
  Объем_ферм$м3 += Стойка_левая.getVolume() + Стойка_правая.getVolume() +
    Стропило_левое.getVolume() + Стропило_правое.getVolume();
  Цена_ферм$руб += Стойка_левая.getPrice() + Стойка_правая.getPrice() +
    Стропило_левое.getPrice() + Стропило_правое.getPrice(); */
}

/* Ребра вальм со стойками и стропилами */
plan.setDefaultMaterial($$Брус100х100).setDefaultKeColor(255, 100, 30);
var Ребро_вальмы_сз = plan.addBeam(0, 0, 7200, 5300, Балки_перекрытия[8].getYStart(), 10200, 100, 100);
var Ребро_вальмы_св = plan.addBeam(5300, Балки_перекрытия[8].getYStart(), 10200, 10600, 0, 7200, 100, 100);
var Ребро_вальмы_юз = plan.addBeam(0, 13500, 7200, 5300, Балки_перекрытия[26].getYStart(), 10200, 100, 100);
var Ребро_вальмы_юв = plan.addBeam(5300, Балки_перекрытия[26].getYStart(), 10200, 10600, 13500, 7200, 100, 100);

plan.setDefaultMaterial($$Брус100х100).setDefaultBackgroundColor(255, 200, 60).setDefaultKeColor(255, 200, 60);
var Стойки_вальм = [
  // СЗ
  plan.addCrossBeam(Ребро_вальмы_сз, Балки_перекрытия[0], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_сз, Балки_перекрытия[2], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_сз, Балки_перекрытия[4], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_сз, Балки_перекрытия[6], 100, 100),

  // СВ
  plan.addCrossBeam(Ребро_вальмы_св, Балки_перекрытия[0], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_св, Балки_перекрытия[2], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_св, Балки_перекрытия[4], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_св, Балки_перекрытия[6], 100, 100),

  // ЮЗ
  plan.addCrossBeam(Ребро_вальмы_юз, Балки_перекрытия[26], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юз, Балки_перекрытия[28], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юз, Балки_перекрытия[30], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юз, Балки_перекрытия[32], 100, 100),

  // ЮВ
  plan.addCrossBeam(Ребро_вальмы_юв, Балки_перекрытия[26], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юв, Балки_перекрытия[28], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юв, Балки_перекрытия[30], 100, 100),
  plan.addCrossBeam(Ребро_вальмы_юв, Балки_перекрытия[32], 100, 100)
];

plan.setDefaultMaterial($$Доска200х50).setDefaultPattern("background").setDefaultBackgroundColor(255, 200, 0).setDefaultKeColor(255, 200, 0);
var Стропила_вальм = [
  // горизонтальные
  // СЗ
  plan.addBeam(0, Балки_перекрытия[0].getYStart()+50, 7200, Стойки_вальм[0].getXStart(), Балки_перекрытия[0].getYStart()+50, Стойки_вальм[0].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[2].getYStart()+50, 7200, Стойки_вальм[1].getXStart(), Балки_перекрытия[2].getYStart()+50, Стойки_вальм[1].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[4].getYStart()+50, 7200, Стойки_вальм[2].getXStart(), Балки_перекрытия[4].getYStart()+50, Стойки_вальм[2].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[6].getYStart()+50, 7200, Стойки_вальм[3].getXStart(), Балки_перекрытия[6].getYStart()+50, Стойки_вальм[3].getZStart(), 50, 200),
  // СВ
  plan.addBeam(Стойки_вальм[4].getXStart(), Балки_перекрытия[0].getYStart()+50, Стойки_вальм[4].getZStart(), 10600, Балки_перекрытия[0].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[5].getXStart(), Балки_перекрытия[2].getYStart()+50, Стойки_вальм[5].getZStart(), 10600, Балки_перекрытия[2].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[6].getXStart(), Балки_перекрытия[4].getYStart()+50, Стойки_вальм[6].getZStart(), 10600, Балки_перекрытия[4].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[7].getXStart(), Балки_перекрытия[6].getYStart()+50, Стойки_вальм[7].getZStart(), 10600, Балки_перекрытия[6].getYStart()+50, 7200, 50, 200),
  // ЮЗ
  plan.addBeam(0, Балки_перекрытия[26].getYStart()+50, 7200, Стойки_вальм[8].getXStart(), Балки_перекрытия[26].getYStart()+50, Стойки_вальм[8].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[28].getYStart()+50, 7200, Стойки_вальм[9].getXStart(), Балки_перекрытия[28].getYStart()+50, Стойки_вальм[9].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[30].getYStart()+50, 7200, Стойки_вальм[10].getXStart(), Балки_перекрытия[30].getYStart()+50, Стойки_вальм[10].getZStart(), 50, 200),
  plan.addBeam(0, Балки_перекрытия[32].getYStart()+50, 7200, Стойки_вальм[11].getXStart(), Балки_перекрытия[32].getYStart()+50, Стойки_вальм[11].getZStart(), 50, 200),
  // ЮВ
  plan.addBeam(Стойки_вальм[12].getXStart(), Балки_перекрытия[26].getYStart()+50, Стойки_вальм[12].getZStart(), 10600, Балки_перекрытия[26].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[13].getXStart(), Балки_перекрытия[28].getYStart()+50, Стойки_вальм[13].getZStart(), 10600, Балки_перекрытия[28].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[14].getXStart(), Балки_перекрытия[30].getYStart()+50, Стойки_вальм[14].getZStart(), 10600, Балки_перекрытия[30].getYStart()+50, 7200, 50, 200),
  plan.addBeam(Стойки_вальм[15].getXStart(), Балки_перекрытия[32].getYStart()+50, Стойки_вальм[15].getZStart(), 10600, Балки_перекрытия[32].getYStart()+50, 7200, 50, 200),

  // вертикальные
  // север
  plan.addConnectXBeam(800+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  plan.addConnectXBeam(1600+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  plan.addConnectXBeam(2350+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  plan.addConnectXBeam(3100+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  x1 = plan.addConnectXBeam(3850+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  x2 = plan.addConnectXBeam(4600+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  x3 = plan.addConnectXBeam(5350+50, 0, 7200, Ребро_вальмы_сз, 50, 200),
  x4 = plan.addConnectXBeam(6100+50, 0, 7200, Ребро_вальмы_св, 50, 200),
  x5 = plan.addConnectXBeam(6850+50, 0, 7200, Ребро_вальмы_св, 50, 200),
  plan.addConnectXBeam(7600+50, 0, 7200, Ребро_вальмы_св, 50, 200),
  plan.addConnectXBeam(8350+50, 0, 7200, Ребро_вальмы_св, 50, 200),
  plan.addConnectXBeam(9100+50, 0, 7200, Ребро_вальмы_св, 50, 200),
  plan.addConnectXBeam(9850+50, 0, 7200, Ребро_вальмы_св, 50, 200),

  // юг
  plan.addConnectXBeam(800+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  plan.addConnectXBeam(1600+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  plan.addConnectXBeam(2350+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  plan.addConnectXBeam(3100+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  y1 = plan.addConnectXBeam(3850+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  y2 = plan.addConnectXBeam(4600+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  y3 = plan.addConnectXBeam(5350+50, 13600, 7200, Ребро_вальмы_юз, 50, 200),
  y4 = plan.addConnectXBeam(6100+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),
  y5 = plan.addConnectXBeam(6850+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),
  plan.addConnectXBeam(7600+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),
  plan.addConnectXBeam(8350+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),
  plan.addConnectXBeam(9100+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),
  plan.addConnectXBeam(9850+50, 13600, 7200, Ребро_вальмы_юв, 50, 200),

  /* Стойки стропил северной и южной вальм */
  plan.addCrossBeam(x1, Балки_перекрытия[2], 100, 100).setMaterial($$Брус100х100).move(-100, 0, 0),
  plan.addCrossBeam(x2, Балки_перекрытия[2], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
//  plan.addCrossBeam(x3, Балки_перекрытия[2], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
  plan.addCrossBeam(x4, Балки_перекрытия[2], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
  plan.addCrossBeam(x5, Балки_перекрытия[2], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
  plan.addCrossBeam(y1, Балки_перекрытия[30], 100, 100).setMaterial($$Брус100х100).move(-100, 0, 0),
  plan.addCrossBeam(y2, Балки_перекрытия[30], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
//  plan.addCrossBeam(y3, Балки_перекрытия[30], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
  plan.addCrossBeam(y4, Балки_перекрытия[30], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0),
  plan.addCrossBeam(y5, Балки_перекрытия[30], 100, 100).setMaterial($$Брус100х100).move(100, 0, 0)
];

/*
Вес_вальм$тн = Ребро_вальмы_сз.getWeight() + Ребро_вальмы_св.getWeight() + Ребро_вальмы_юз.getWeight() + Ребро_вальмы_юв.getWeight();
Объем_вальм$м3 = Ребро_вальмы_сз.getVolume() + Ребро_вальмы_св.getVolume() + Ребро_вальмы_юз.getVolume() + Ребро_вальмы_юв.getVolume();
Цена_вальм$руб = Ребро_вальмы_сз.getPrice() + Ребро_вальмы_св.getPrice() + Ребро_вальмы_юз.getPrice() + Ребро_вальмы_юв.getPrice();
for (var i = 0; i < Стойки_вальм.length; i ++) {
  Вес_вальм$тн += Стойки_вальм[i].getWeight();
  Объем_вальм$м3 += Стойки_вальм[i].getVolume();
  Цена_вальм$руб += Стойки_вальм[i].getPrice();
}
for (var i = 0; i < Стропила_вальм.length; i ++) {
  Вес_вальм$тн += Стропила_вальм[i].getWeight();
  Объем_вальм$м3 += Стропила_вальм[i].getVolume();
  Цена_вальм$руб += Стропила_вальм[i].getPrice();
} */

/* Стойки конька */
plan.setDefaultMaterial($$Брус150х150).setDefaultKeColor(255, 200, 60);
var Стойки_конька = [
  plan.addConnectBeam(Балки_перекрытия[8], 5000, Ребро_вальмы_сз, 150, 150),
  plan.addConnectBeam(Балки_перекрытия[24], 5000, Ребро_вальмы_юз, 150, 150)
];
Вес_стоек_конька$тн = 0;
Объем_стоек_конька$м3 = 0;
Цена_стоек_конька$руб = 0;
for (var i = 0; i < Стойки_конька.length; i ++) {
  Вес_стоек_конька$тн += Стойки_конька[i].getWeight();
  Объем_стоек_конька$м3 += Стойки_конька[i].getVolume();
  Цена_стоек_конька$руб += Стойки_конька[i].getPrice();
}
/*
$$1 = "\nИтого:";
Итого_вес_перекрытия$тн = toStr(Вес_балок_перекрытия$тн, 3);
Итого_цена_перекрытия$руб = toStr(Цена_балок_перекрытия$руб, 0);
Итого_вес_дерева$тн = toStr(Вес_балок_перекрытия$тн + Вес_ферм$тн + Вес_вальм$тн + Вес_стоек_конька$тн, 3);
Итого_объем_дерева$м3 = toStr(Объем_балок_перекрытия$м3 + Объем_ферм$м3 + Объем_вальм$м3 + Объем_стоек_конька$м3, 2);
Итого_цена_дерева$руб = toStr(Цена_балок_перекрытия$руб + Цена_ферм$руб + Цена_вальм$руб + Цена_стоек_конька$руб, 0);
*/
// Труба смещена на -300мм по Y
var Труба = plan.addWall(6170, 10300-300, 6000, 6870, 10600-300, 11000).setPattern("brick").setKeColor(255, 80, 80);

plan.addLight("ambient").setCenter(5000, 6000, 10000);
plan.addLight("directional").setCenter(5000, 6000, 10000).setDirection(0, 0, 0);

Console.printVariables();
Console.print("*** Конец расчета Крыша 3D ***");
