/**
  * Основано на Курсе лекций Залесского В.Г.
  *
*/

/**
  * h - высота в см
  * w - ширина в см
  * W - момент сопротивления, см3
  * J - момент инерции, см4
*/
var Сортамент_Деревянные_Балки = [
  // сначала наиболее употребительные размеры
  { h:5,  w:5,  W:20.8, J:52.1 },
  { h:10, w:5,  W:83,   J:417 },
  { h:15, w:5,  W:187,  J:1406 },
  { h:20, w:5,  W:333,  J:3333 },
  { h:10, w:10, W:167,  J:833 },
  { h:15, w:10, W:375,  J:2812 },
  { h:20, w:10, W:667,  J:6670 },
  { h:15, w:15, W:563,  J:4219 },
  { h:20, w:15, W:1000, J:10000 },
  { h:20, w:20, W:1333, J:13333 },

  // ширина 50 мм
  { h:6,  w:5,  W:30,   J:90 },
  { h:8,  w:5,  W:5.3,  J:213.2 },
  { h:12, w:5,  W:120,  J:720 },
  { h:18, w:5,  W:270,  J:2430 },
  { h:22, w:5,  W:403,  J:4435 },

  // ширина 60 мм
  { h:5,  w:6,  W:25,   J:62.5 },
  { h:8,  w:6,  W:64,   J:256 },
  { h:10, w:6,  W:100,  J:500 },
  { h:12, w:6,  W:144,  J:864 },
  { h:15, w:6,  W:225,  J:1685 },
  { h:18, w:6,  W:324,  J:2916 },
  { h:20, w:6,  W:400,  J:4000 },
  { h:22, w:6,  W:484,  J:5324 },

  // ширина 80 мм
  { h:5,  w:8,  W:33.3, J:83.3 },
  { h:6,  w:8,  W:48,   J:144 },
  { h:8,  w:8,  W:85,   J:340 },
  { h:10, w:8,  W:133,  J:667 },
  { h:12, w:8,  W:192,  J:1152 },
  { h:15, w:8,  W:300,  J:2250 },
  { h:18, w:8,  W:432,  J:3888 },
  { h:20, w:8,  W:533,  J:5333 },
  { h:22, w:8,  W:645,  J:7099 },

  // ширина 10 мм
  { h:5,  w:10, W:42,   J:104 },
  { h:6,  w:10, W:60,   J:180 },
  { h:8,  w:10, W:106,  J:426 },
  { h:12, w:10, W:240,  J:1144 },
  { h:18, w:10, W:540,  J:4860 },
  { h:22, w:10, W:807,  J:8873 },

  // ширина 120 мм
  { h:5,  w:12, W:50,   J:125 },
  { h:6,  w:12, W:72,   J:216 },
  { h:8,  w:12, W:128,  J:512 },
  { h:10, w:12, W:202,  J:1000 },
  { h:12, w:12, W:288,  J:1728 },
  { h:15, w:12, W:450,  J:3345 },
  { h:18, w:12, W:648,  J:5830 },
  { h:20, w:12, W:800,  J:8000 },
  { h:22, w:12, W:965,  J:10640 },

  // ширина 150 мм
  { h:5,  w:15, W:62.5, J:156.25 },
  { h:6,  w:15, W:90,   J:270 },
  { h:8,  w:15, W:160,  J:638 },
  { h:10, w:15, W:250,  J:1250 },
  { h:12, w:15, W:360,  J:2160 },
  { h:18, w:15, W:810,  J:7290 },
  { h:22, w:15, W:1200, J:13300 },

  // ширина 180 мм
  { h:5,  w:18, W:75,   J:187.5 },
  { h:6,  w:18, W:108,  J:324 },
  { h:8,  w:18, W:192,  J:758 },
  { h:10, w:18, W:300,  J:1500 },
  { h:12, w:18, W:432,  J:2584 },
  { h:15, w:18, W:675,  J:5051 },
  { h:18, w:18, W:972,  J:8748 },
  { h:20, w:18, W:1200, J:12000 },
  { h:22, w:18, W:1450, J:15970 },

  // ширина 200 мм
  { h:5,  w:20, W:83.3, J:208.3 },
  { h:6,  w:20, W:120,  J:360 },
  { h:8,  w:20, W:216,  J:832 },
  { h:10, w:20, W:334,  J:1668 },
  { h:12, w:20, W:480,  J:2880 },
  { h:15, w:20, W:750,  J:5620 },
  { h:18, w:20, W:1080, J:9700 },
  { h:22, w:20, W:1610, J:17750 },

  // ширина 220 мм
  { h:5,  w:22, W:92,    J:230 },
  { h:6,  w:22, W:132,   J:296 },
  { h:8,  w:22, W:236,   J:938 },
  { h:10, w:22, W:366.5, J:1833 },
  { h:12, w:22, W:528,   J:3164 },
  { h:15, w:22, W:825,   J:6200 },
  { h:18, w:22, W:1188,  J:10680 },
  { h:20, w:22, W:1469,  J:14665 },
  { h:22, w:22, W:1775,  J:19214 }
]

function Рассчитать_W_МоментСопротивления_См3_Деревянной_Балки(Mmax_Максимальный_Сгибающий_Момент_Кг_См) {
    var R_ПрочноеСопротивлениеДерева_Кг_на_См2 = 130;
    var W = Рассчитать_W_МоментСопротивления_См3(Mmax_Максимальный_Сгибающий_Момент_Кг_См, R_ПрочноеСопротивлениеДерева_Кг_на_См2);
    return W;
}

function Рассчитать_f_Стрела_Прогиба_См_Деревянной_Балки(p_Постоянная_Нагрузка_Кг_На_М, l_ДлинаБалки_См, J_МоментИнерции_См4) {
    var E_Коэффициент_Упругости_Дерева_Кг_На_См2 = 100000;
    var f = Рассчитать_f_Стрела_Прогиба_См(p_Постоянная_Нагрузка_Кг_На_М, l_ДлинаБалки_См, J_МоментИнерции_См4, E_Коэффициент_Упругости_Дерева_Кг_На_См2);
    return f;
}

function Найти_Деревянную_Балку(W_МоментСопротивления_См3) {
    for (var i = 0; i < Сортамент_Деревянные_Балки.length; i ++) {
        var Балка = Сортамент_Деревянные_Балки[i];
        if (Балка.W > W_МоментСопротивления_См3) {
            return Балка;
        }
    }
    return null;
}

function Описание_Балки(Балка) {
    if (Балка == null) return "Балка не найдена";
    return Балка.h*10 + "x" + Балка.w*10 + " мм";
}